# Exercise 4.5

# Index
01 Importing Libraries

02 Importing Data

03 Mixed-Type Data

04 Missing Values

05 Duplicate

# 01. Importing Data

In [86]:
# Import libraries
import pandas as pd
import numpy as np
import os

# 02. Importing Data

In [88]:
# create path
path = r'C:\Users\kthav\My Pc\Desktop\Career Foundry\Data Immersion\Python Fundamentals for Data Analytics\11-12-2024 Instacart Basket Analysis'

In [89]:
# import products.csv as df_prods
df_prods = pd.read_csv(os.path.join(path, 'Data', 'Original Data', 'products.csv'), index_col = False)

In [90]:
# import orders_wrangled as df_ords
df_ords = pd.read_csv(os.path.join(path, 'Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

# 03. Mixed-Type Data

In [92]:
# Create a dataframe
df_test = pd.DataFrame()

In [93]:
# Create a mixed type column
df_test['mix'] = ['a', 'b', 1, True]

In [94]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [95]:
# Check for mixed types
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

C:\Users\kthav\AppData\Local\Temp\ipykernel_18060\772068622.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)

## Dear Kimera, please help with this output (above). I googled and used chatgpt however it confused me further.

In [97]:
# Fix mix column by changing values to str
df_test['mix'] = df_test['mix'].astype('str')

# 04. Missing Values

In [99]:
# Find missing values in df_prods
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [100]:
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [101]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [102]:
df_prods.shape

(49693, 5)

In [103]:
# create a cleaned df_prods df to reflect no NaN values
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [104]:
df_prods_clean.shape

(49677, 5)

# 05. Duplicates

In [106]:
# create df_prods df to identify full duplicates within df_prods_clean
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [107]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [108]:
df_prods_clean.shape

(49677, 5)

In [109]:
# delete duplicates - create new df without duplicates
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [110]:
df_prods_clean_no_dups.shape

(49672, 5)

# 05. Export dataframe

In [112]:
# export df_prods_clean_no_dups as products_checked.csv
df_prods_clean_no_dups.to_csv(os.path.join(path, 'Data', 'Prepared Data', 'products_checked.csv'))

# 06 Exercise 4.5

## Question 2

In [115]:
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

## Answer question 2 -
                       a. One unamed column
                       b. order_id count matches max value, indicating that order numbers start from 1
                       c. order_number max value is 100, we need to double check if a client ordered 100 times or is this a mistake
                       d. days of the week seem normal with 0 representing the 1st day and 6 representing the last
                       e. order hour of the day indiactes min of 0 and max of 23 which seems fine as it represents all 24 hours of the
                          day
                       f. days ince last order has a min 0f 0 which may indicate a client ordering twice in a day or perhaps and error. 
                          The max value is 30 which indicates that no client had wating periods of no more than 30  between 
                          orders or it could be a potential problem  where the number resets after 30 or is capped at 30

## Question 3

In [118]:
# check for mixed-type data in df_ords
for col in df_ords.columns:
    # Check if the type of each element in the column matches the type of the first element
    weird = (df_ords[col].map(type) != type(df_ords[col].iloc[0]))
    # If any mismatched types are found, print the column name
    if weird.any():
        print(col)

Unnamed: 0
order_id
user_id
order_number
orders_day_of_week
order_hour_of_day
days_since_last_order

In [119]:
df_ords.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3421083 entries, 0 to 3421082
Data columns (total 7 columns):
 #   Column                 Dtype
---  ------                 -----
 0   Unnamed: 0             int64
 1   order_id               int64
 2   user_id                int64
 3   order_number           int64
 4   orders_day_of_week     int64
 5   order_hour_of_day      int64
 6   days_since_last_order  float64
dtypes: float64(1), int64(6)
memory usage: 182.7 MB

## Question 4

## Answer question 4


There does not seem to be any mixed-type data in this df

## Question 5

In [124]:
# check for missing values in df_ords
df_ords.isnull().sum()

Unnamed: 0                    0
order_id                      0
user_id                       0
order_number                  0
orders_day_of_week            0
order_hour_of_day             0
days_since_last_order    206209
dtype: int64

In [182]:
# create subset of df_ords with all null values to inspect
df_ords_NaN = df_ords[df_ords['days_since_last_order'].isnull() == True]

In [184]:
df_ords_NaN.head(30)

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order
0,0,2539329,1,1,2,8,NaN
11,11,2168274,2,1,2,11,NaN
26,26,1374495,3,1,1,14,NaN
39,39,3343014,4,1,6,11,NaN
45,45,2717275,5,1,3,12,NaN
50,50,2086598,6,1,5,18,NaN
54,54,2565571,7,1,3,9,NaN
75,75,600894,8,1,6,0,NaN
79,79,280530,9,1,1,17,NaN
83,83,1224907,10,1,2,14,NaN
89,89,2411567,11,1,0,11,NaN
97,97,1483446,12,1,1,12,NaN
103,103,2618231,13,1,6,12,NaN
116,116,2906263,14,1,2,18,NaN
130,130,2514324,15,1,5,13,NaN
153,153,1273676,16,1,2,8,NaN
160,160,1737705,17,1,2,13,NaN
201,201,2780889,18,1,6,18,NaN
208,208,1321974,19,1,6,13,NaN
218,218,947722,20,1,1,10,NaN
223,223,2625565,21,1,1,10,NaN
257,257,2300537,22,1,3,7,NaN
273,273,1792521,23,1,5,14,NaN
278,278,611214,24,1,3,20,NaN
297,297,2610576,25,1,1,14,NaN
301,301,3229714,26,1,2,15,NaN
314,314,361493,27,1,3,9,NaN
396,396,1138968,28,1,0,14,NaN
421,421,2064090,29,1,5,11,NaN
440,440,375303,30,1,1,13,NaN

## Answer question 5 
When inspecting the null values we can see that the values are for customers with order_number value of 1. This means that the customer is new and has only placed one order. The null value will be replaced on their 2nd order.

## Question 6

In [187]:
# Adding a new column first_order as flag variable
df_ords['first_order'] = df_ords['order_number'] == 1

In [189]:
df_ords

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,first_order
0,0,2539329,1,1,2,8,NaN,True
1,1,2398795,1,2,3,7,15.0,False
2,2,473747,1,3,3,12,21.0,False
3,3,2254736,1,4,4,7,29.0,False
4,4,431534,1,5,4,15,28.0,False
...,...,...,...,...,...,...,...,...
3421078,3421078,2266710,206209,10,5,18,29.0,False
3421079,3421079,1854736,206209,11,4,10,30.0,False
3421080,3421080,626363,206209,12,1,12,18.0,False
3421081,3421081,2977660,206209,13,1,12,7.0,False
3421082,3421082,272231,206209,14,6,14,30.0,False

## Answer Question 6
Since the data is valuable are tru there is no need to delete or alter. Instead I created a new column called first_order which will reflect if a tru value if it is the customers firt order and a false value if not. Having this we can quickly check this when conduting analysis and ensure that the day_since_last_order value is really null or is just refelcting values for customers with only one order.

## Question 7

In [193]:
# create df_ords_dups to check for duplicates in df_ords
df_ords_dups = df_ords[df_ords.duplicated]

In [195]:
df_ords_dups

Empty DataFrame
Columns: [Unnamed: 0, order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_last_order, first_order]
Index: []

## Answer question 7
No duplicates found

## Question 8
No duplicates found so no further action

## Question 9

In [ ]:
# export df_ords as orders_checked.csv
df_ords.to_csv(os.path.join(path, 'Data', 'Prepared Data', 'orders_checked.csv'))